content/topics/harmonic_mixing.md
+++
title = "Harmonic mixing"
author = ["hermes"]
tags = ["music"]
draft = false
+++

## Overview {#overview}

Harmonic mixing is the practice of sequencing DJ tracks so that adjacent tracks share compatible key signatures, preventing clashing notes when one song is mixed into the next. Instead of choosing tracks purely by tempo or energy, the DJ uses a map of musical keys to navigate harmonic transitions. The result is mixes that feel tonally coherent — even euphoric — rather than dissonant.


## The Camelot wheel {#the-camelot-wheel}

The Camelot wheel is a proprietary notation system (developed by Mixed In Key) that remaps the 24 major and minor keys onto a clock-face numbered 1–12, with an inner ring for minor keys (A suffix) and an outer ring for major keys (B suffix). Rules:

-   **Same position** — identical key; always compatible.
-   **Adjacent number** (+1 or −1, same letter) — adjacent on the [Circle of fifths]({{< relref "circle_of_fifths.md" >}}); shares 11 of 12 pitches; very smooth.
-   **Same number, switch letter** (A↔B) — relative major/minor; shares all 7 diatonic pitches; works well.
-   **+7 (energy boost)** — move 7 positions clockwise; introduces tension and energy shift; used for dramatic drops.

Camelot notation for common keys: F minor = 4A, Bb minor = 3A, Ab major = 4B, Bb Dorian (treated as Bb minor context) ≈ 3A.


## Why it works musically {#why-it-works-musically}

Adjacent keys on the circle of fifths differ by only one note. When two tracks share a key (or are in adjacent keys), the harmonic overtones reinforce rather than clash. In a well-planned set, the key journey itself becomes a compositional arc — see [DJ set arc]({{< relref "dj_set_arc.md" >}}).


## Example: 3-track harmonic set in 4-flat key area {#example-3-track-harmonic-set-in-4-flat-key-area}

A set built around the 4-flat key signature (Bb, Eb, Ab, Db) keeps all three tracks in/around Camelot 4A–3A–4B:

-   Track 1 (F minor, 4A) → Track 2 (Bb Dorian / minor, 3A) → Track 3 (Ab major, 4B).
-   Each transition is a single step on the Camelot wheel; no note clashes.
-   Consistent BPM (122–124) enables seamless beat matching throughout.

See also: [House music]({{< relref "house_music.md" >}}), [Relative major and minor]({{< relref "relative_major_minor.md" >}}), [DJ set arc]({{< relref "dj_set_arc.md" >}}).


## Resources {#resources}

-   2026-06-07 ◦ [House Music: Melody, Bass Lines, and Harmony](~/repos/priv/roam-sources/articles/2026/2026-06-07_house-music-theory-melody-bass-harmony.md) — illustrated harmonic mixing with a 3-track set all sharing a 4-flat key signature, enabling smooth Camelot-wheel transitions from F minor through Bb Dorian to Ab major
